---
title: DuctFittingAndAccessoryPressureDropData
classe: Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# DuctFittingAndAccessoryPressureDropData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 CalculationType { get; }` | `ductFittingAndAccessoryPressureDropData.CalculationType` | Int32 |
| `Boolean IsCurrentEntityValid { get; set; }` | `ductFittingAndAccessoryPressureDropData.IsCurrentEntityValid` | Boolean |
| `Boolean IsValidObject { get; }` | `ductFittingAndAccessoryPressureDropData.IsValidObject` | Boolean |
| `Void Dispose()` | `ductFittingAndAccessoryPressureDropData.Dispose()` | Void |
| `DuctFittingAndAccessoryData GetDuctFittingAndAccessoryData()` | `ductFittingAndAccessoryPressureDropData.GetDuctFittingAndAccessoryData()` | DuctFittingAndAccessoryData |
| `IList<DuctFittingAndAccessoryPressureDropItem> GetPresureDropItems()` | `ductFittingAndAccessoryPressureDropData.GetPresureDropItems()` | IList<DuctFittingAndAccessoryPressureDropItem> |
| `Void SetDefaultEntity(Entity)` | `ductFittingAndAccessoryPressureDropData.SetDefaultEntity(defaultEntity)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```